perfTest/stage6/get.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.57ms    2.39ms 208.90ms   97.75%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    1.81ms
 90.000%    2.29ms
 99.000%    5.84ms
 99.900%   11.69ms
 99.990%   37.25ms
 99.999%  209.02ms
100.000%  209.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.240     0.000000            1         1.00
       0.713     0.100000          980         1.11
       0.895     0.200000         1958         1.25
       1.061     0.300000         2936         1.43
       1.225     0.400000         3918         1.67
       1.387     0.500000         4895         2.00
       1.468     0.550000         5386         2.22
       1.545     0.600000         5873         2.50
       1.624     0.650000         6357         2.86
       1.706     0.700000         6851         3.33
       1.806     0.750000         7335         4.00
       1.864     0.775000         7581         4.44
       1.926     0.800000         7828         5.00
       1.993     0.825000         8067         5.71
       2.077     0.850000         8312         6.67
       2.175     0.875000         8557         8.00
       2.231     0.887500         8683         8.89
       2.289     0.900000         8802        10.00
       2.365     0.912500         8923        11.43
       2.463     0.925000         9046        13.33
       2.605     0.937500         9167        16.00
       2.707     0.943750         9229        17.78
       2.817     0.950000         9290        20.00
       2.979     0.956250         9353        22.86
       3.167     0.962500         9413        26.67
       3.415     0.968750         9473        32.00
       3.549     0.971875         9503        35.56
       3.761     0.975000         9534        40.00
       4.035     0.978125         9565        45.71
       4.495     0.981250         9595        53.33
       4.951     0.984375         9626        64.00
       5.235     0.985938         9641        71.11
       5.459     0.987500         9657        80.00
       5.787     0.989062         9672        91.43
       6.027     0.990625         9687       106.67
       6.447     0.992188         9702       128.00
       6.551     0.992969         9710       142.22
       6.715     0.993750         9717       160.00
       7.003     0.994531         9725       182.86
       7.291     0.995313         9733       213.33
       7.519     0.996094         9740       256.00
       7.663     0.996484         9744       284.44
       7.955     0.996875         9748       320.00
       8.447     0.997266         9752       365.71
       9.255     0.997656         9756       426.67
       9.839     0.998047         9759       512.00
      10.071     0.998242         9761       568.89
      10.479     0.998437         9763       640.00
      10.575     0.998633         9765       731.43
      11.431     0.998828         9767       853.33
      11.775     0.999023         9769      1024.00
      12.751     0.999121         9770      1137.78
      16.799     0.999219         9771      1280.00
      16.911     0.999316         9772      1462.86
      17.775     0.999414         9773      1706.67
      26.927     0.999512         9774      2048.00
      26.927     0.999561         9774      2275.56
      30.703     0.999609         9775      2560.00
      30.703     0.999658         9775      2925.71
      34.367     0.999707         9776      3413.33
      34.367     0.999756         9776      4096.00
      34.367     0.999780         9776      4551.11
      37.247     0.999805         9777      5120.00
      37.247     0.999829         9777      5851.43
      37.247     0.999854         9777      6826.67
      37.247     0.999878         9777      8192.00
      37.247     0.999890         9777      9102.22
     209.023     0.999902         9778     10240.00
     209.023     1.000000         9778          inf
#[Mean    =        1.565, StdDeviation   =        2.395]
#[Max     =      208.896, Total count    =         9778]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9782 requests in 10.00s, 699.19KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
  Non-2xx or 3xx responses: 5373
Requests/sec:    977.86
Transfer/sec:     69.90KB