perfTest/stage6/put.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.51ms    1.10ms  28.94ms   94.41%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.37ms
 75.000%    1.75ms
 90.000%    2.19ms
 99.000%    5.64ms
 99.900%   16.61ms
 99.990%   25.18ms
 99.999%   28.96ms
100.000%   28.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.174     0.000000            1         1.00
       0.730     0.100000          982         1.11
       0.895     0.200000         1968         1.25
       1.058     0.300000         2934         1.43
       1.216     0.400000         3914         1.67
       1.368     0.500000         4892         2.00
       1.439     0.550000         5381         2.22
       1.512     0.600000         5866         2.50
       1.584     0.650000         6354         2.86
       1.665     0.700000         6849         3.33
       1.753     0.750000         7336         4.00
       1.801     0.775000         7576         4.44
       1.852     0.800000         7827         5.00
       1.916     0.825000         8068         5.71
       1.986     0.850000         8310         6.67
       2.079     0.875000         8560         8.00
       2.127     0.887500         8676         8.89
       2.189     0.900000         8799        10.00
       2.255     0.912500         8920        11.43
       2.335     0.925000         9042        13.33
       2.431     0.937500         9166        16.00
       2.487     0.943750         9226        17.78
       2.575     0.950000         9287        20.00
       2.699     0.956250         9349        22.86
       2.923     0.962500         9409        26.67
       3.193     0.968750         9470        32.00
       3.441     0.971875         9501        35.56
       3.685     0.975000         9531        40.00
       3.899     0.978125         9562        45.71
       4.235     0.981250         9592        53.33
       4.731     0.984375         9623        64.00
       4.931     0.985938         9639        71.11
       5.179     0.987500         9654        80.00
       5.507     0.989062         9669        91.43
       5.883     0.990625         9684       106.67
       6.299     0.992188         9699       128.00
       6.511     0.992969         9707       142.22
       6.635     0.993750         9714       160.00
       6.995     0.994531         9722       182.86
       7.243     0.995313         9730       213.33
       7.695     0.996094         9737       256.00
       7.983     0.996484         9741       284.44
       8.263     0.996875         9745       320.00
       8.471     0.997266         9749       365.71
       9.207     0.997656         9753       426.67
       9.335     0.998047         9756       512.00
       9.639     0.998242         9758       568.89
      10.023     0.998437         9761       640.00
      10.359     0.998633         9762       731.43
      10.727     0.998828         9764       853.33
      16.911     0.999023         9766      1024.00
      17.183     0.999121         9767      1137.78
      18.303     0.999219         9768      1280.00
      19.087     0.999316         9769      1462.86
      19.215     0.999414         9770      1706.67
      23.167     0.999512         9771      2048.00
      23.167     0.999561         9771      2275.56
      23.327     0.999609         9772      2560.00
      23.327     0.999658         9772      2925.71
      24.271     0.999707         9773      3413.33
      24.271     0.999756         9773      4096.00
      24.271     0.999780         9773      4551.11
      25.183     0.999805         9774      5120.00
      25.183     0.999829         9774      5851.43
      25.183     0.999854         9774      6826.67
      25.183     0.999878         9774      8192.00
      25.183     0.999890         9774      9102.22
      28.959     0.999902         9775     10240.00
      28.959     1.000000         9775          inf
#[Mean    =        1.508, StdDeviation   =        1.098]
#[Max     =       28.944, Total count    =         9775]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9779 requests in 10.00s, 650.84KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
  Non-2xx or 3xx responses: 490
Requests/sec:    977.79
Transfer/sec:     65.08KB